postIt_app/app/controllers/post_its_controller.rb

SELECT "post_its".* FROM "post_its"
---
  def index
    @post_its = PostIt.all

INSERT INTO "post_its" ("title", "content", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "m"], ["content", "m"], ["created_at", "2018-05-29 17:38:24.349844"], ["updated_at", "2018-05-29 17:38:24.349844"]]
---
  def create
    @post_it = PostIt.new(post_it_params)

    if @post_it.save

UPDATE "post_its" SET "title" = $1, "content" = $2, "updated_at" = $3 WHERE "post_its"."id" = $4  [["title", "sdkfjs"], ["content", "fjksk"], ["updated_at", "2018-05-31 23:26:03.948573"], ["id", 2]]
---
  def update
    if @post_it.update(post_it_params)

DELETE FROM "post_its" WHERE "post_its"."id" = $1  [["id", 9]]
---
  def destroy
    @post_it.destroy

SELECT  "post_its".* FROM "post_its" WHERE "post_its"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
    def set_post_it
      @post_it = PostIt.find(params[:id])